SlaveNarrativesSAE-master/CodeSource/Web/Version3/racine_recit_resclave/racine/app/Models/ModelAdmin.php

SELECT `pwd`
FROM `user`
WHERE `user`.`user` = 'admin'
 LIMIT 1
---
    public function getPass($username)
	{
        $result = $this->select('pwd')
                        ->Where(['user.user' => $username])
                        ->limit(1)
                        ->get()
                        ->getRow();